<template>
    <section class="w-full max-w-[64.8125rem] mx-auto  pt-10 pb-10">
        <article class=" w-full flex flex-col items-center space-y-8">
           <div class=" w-full flex flex-col items-center space-y-4">
               <h1 class=" text-black font-Inter text-[2rem] sm:text-[2.5rem] font-normal">Генератор картинки по описанию</h1>
                <p class=" text-black font-Inter text-xl font-normal max-w-[59.0925rem]">
                  Откройте для себя творческие возможности с нейросетью, которая создает картинки из текста. Преобразуйте ваши идеи в визуальное искусство всего за несколько кликов. Введите ваш текст, выберите стиль, укажите форму изображения и количество результатов, которые вы хотите увидеть. Generator AI создаст арт, соответствующий вашему описанию. Art-Generator.ai — это инновационная платформа, которая оживляет ваши слова. Будь то сюрреалистичный пейзаж, детализированный эскиз персонажа или уникальный абстрактный дизайн, наш инструмент генерирует высококачественные изображения за секунды. Просто введите описание, выберите предпочитаемый стиль искусства, определите форму и решите, сколько вариаций вы хотите. AI сделает остальное. Наш AI для преобразования текста в изображение доступен через любой веб-браузер и поддерживает все устройства (ПК, Mac, Android, iOS) без необходимости в дополнительном программном обеспечении. Этот мощный инструмент идеален для художников, дизайнеров, создателей контента или любого, кто хочет воплотить свои творческие концепции в визуальную реальность.
                     </p>
           </div>
              <div class=" w-full flex flex-col items-center space-y-6">
               <h1 class=" text-black font-Inter text-[2rem] sm:text-[2.5rem] font-normal">Почему стоит использовать нейросеть</h1>
              <div class="text-black font-Inter text-xl font-normal max-w-[59.0925rem]">
                <p>
                    Генератор текста в изображение от искусственного интеллекта открывает новое измерение в создании цифрового искусства. Это отличный инструмент для художников, исследующих новые стили, маркетологов, создающих привлекательные визуалы, и писателей, визуализирующих сцены или персонажей. К тому же он невероятно удобен и эффективен.
                    <br> Функции генератора текста в изображение:
                </p>
                <ul class="pl-8 list-disc">
                    <li>
                        Настройка текстового ввода: Опишите подробно, что вы хотите, и наш AI преобразует ваши слова в изображения.
                    </li>
                    <li>
                        Множество художественных стилей: Выберите из разнообразия стилей, таких как аниме в стиле живописи, цифровая живопись, винтажный комикс, акварель и многое другое.
                    </li>
                    <li>
                        Выбор формы: Укажите форму изображения - будь то широкий пейзаж, высокий портрет или стандартный квадрат.
                    </li>
                    <li>
                        Контроль количества: Определите, сколько результатов изображения вы хотите получить от одного запроса, получая несколько визуальных интерпретаций вашего текста.
                    </li>
                    <li>
                        Изображения высокого качества: Наслаждайтесь изображениями высокого разрешения, созданными нашим передовым AI, сохраняющим качество и суть вашей первоначальной идеи.
                    </li>
                </ul>

                <p>
                    Как сгенерировать изображения из текста? Шаг 1: Посетите Text-to-Image.ai на вашем устройстве.
                    Шаг 2: Введите описательный текст в поле ввода.
                    Шаг 3: Выберите желаемый художественный стиль, форму и количество результатов.
                    Шаг 4: Нажмите кнопку "Сгенерировать".
                    Шаг 5: Просмотрите изображения, созданные AI на основе вашего описания.
                    Выберите и загрузите свои любимые прямо на ваше устройство. С Text-to-Image.ai вы можете превратить любую текстовую концепцию в потрясающее визуальное искусство. Мы постоянно обновляем наш AI, чтобы предоставить вам лучший и самый инновационный опыт. Поделитесь этим инструментом с друзьями и семьей и начните творить сегодня! Наш инструмент уважает творческий процесс и предназначен для этичного использования.
                </p>
            </div>

           </div>
        </article>
    </section>
</template>