<template>
    <section class="w-full max-w-[64.8125rem] mx-auto  pt-10 pb-10">
        <article class=" w-full flex flex-col items-center space-y-8">
           <div class=" w-full flex flex-col items-center space-y-4">
               <h1 class=" text-black font-Inter text-[2rem] sm:text-[2.5rem] font-normal">説明に基づく画像ジェネレーター</h1>
                <p class=" text-black font-Inter text-xl font-normal max-w-[59.0925rem]">
                   テキストから画像を作成するニューラルネットワークで、創造的な可能性を探求しましょう。数クリックであなたのアイデアを視覚アートに変換します。テキストを入力し、スタイルを選択し、画像の形状と見たい結果の数を指定してください。Generator AIがあなたの説明に合ったアートを作成します。Art-Generator.aiは、あなたの言葉を生き生きとさせる革新的なプラットフォームです。シュールな風景、詳細なキャラクタースケッチ、ユニークな抽象デザインなど、当ツールは数秒で高品質の画像を生成します。説明を入力し、好みのアートスタイルを選択し、形状を定義し、何バリエーションを望むか決めてください。AIが残りを行います。テキストを画像に変換するAIは、どのウェブブラウザからでもアクセス可能で、追加のソフトウェアなしにすべてのデバイス（PC、Mac、Android、iOS）をサポートしています。この強力なツールは、アーティスト、デザイナー、コンテンツクリエーター、または創造的なコンセプトを視覚的現実に変えたい人に最適です。
                             </p>
           </div>
              <div class=" w-full flex flex-col items-center space-y-6">
               <h1 class=" text-black font-Inter text-[2rem] sm:text-[2.5rem] font-normal">ニューラルネットワークを使う理由</h1>
                <div class="text-black font-Inter text-xl font-normal max-w-[59.0925rem]">
    <p>
        テキストから画像へのAIジェネレーターは、デジタルアート制作に新しい次元を開きます。新しいスタイルを探求するアーティスト、魅力的なビジュアルを作成するマーケティング担当者、シーンやキャラクターを視覚化するライターにとって素晴らしいツールです。また、非常に使いやすく効率的です。
        <br> テキストから画像へのジェネレーターの機能：
    </p>
    <ul class="pl-8 list-disc">
        <li>
            カスタマイズ可能なテキスト入力：あなたが何を望むか詳細に説明し、私たちのAIがあなたの言葉を画像に変換します。
        </li>
        <li>
            多様なアートスタイル：ペイントされたアニメ、デジタルペインティング、ヴィンテージコミック、水彩画など、さまざまなスタイルから選択できます。
        </li>
        <li>
            形状の選択：広い風景、高いポートレート、または標準的な正方形など、画像の形状を指定してください。
        </li>
        <li>
            数量コントロール：一つのプロンプトから何枚の画像結果を得たいか決め、テキストの複数の視覚的解釈を得ます。
        </li>
        <li>
            高品質の画像：私たちの先進的なAIによって生成される高解像度の画像を楽しみ、元のアイデアの品質と本質を保持します。
        </li>
    </ul>

    <p>
        テキストから画像を生成する方法：ステップ1：デバイスでText-to-Image.aiにアクセスします。
        ステップ2：入力ボックスに説明文を入力します。
        ステップ3：希望するアートスタイル、形状、結果の数を選択します。
        ステップ4：「生成」ボタンをクリックします。
        ステップ5：あなたの説明に基づいてAIが生成した画像を見ます。
        お気に入りを選択してデバイスに直接ダウンロードします。Text-to-Image.aiを使用すると、あらゆるテキストのコンセプトを驚くべき視覚アートに変えることができます。最高で最も革新的な経験を提供するために、私たちはAIを常に更新しています。このツールを友人や家族と共有し、今日から創造を始めましょう！ 私たちのツールは創造的なプロセスを尊重し、倫理的な使用のために設計されています。
    </p>
</div>

           </div>
        </article>
    </section>
</template>